{"pageProps":{"article":{"id":"inside-major-dom-v-1-0-exploring-the-architecture-of-a-new-smart-home-system","date":"2023-06-01","date_pretty":"June 1st, 2023","read_time":"3 min","title":"Inside MajorDom v1.0: Exploring the Architecture of a New Smart Home System","description":"Exploring the Architecture of MajorDom v1.0: Dive into the inner workings of MajorDom v1.0. Learn about its core components, fault tolerance and offline capabilities.","keywords":["majordom","smarthome","smart home","voice assistant","home automation","smart home system","smart devices","mobile development","backend development","raspberry pi","arduino"],"tweetId":"1664284619909521409"},"mdxBody":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"In the previous article, I talked about the origin of the idea to create a new smart home. Now, I want to take a closer look at the architecture of the system.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"MajorDom consists of several key components: devices, hub, cloud, bridge, mobile application, and voice assistant.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Devices play a crucial role in the system as they enable control over physical parts of the home. They communicate using radio modules and the “Merlin” protocol that receive commands from the hub, and transmit events back to it.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The hub is the central element of the system. It manages the devices and coordinates their operations. The hub holds the main database with information about users, home, rooms, and devices. Through a local HTTP server and WS server, the hub provides an API for interacting with the database and high-level controlling the devices.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The cloud is the server-side component and plays a vital role in user authentication. It stores the database of users, homes, hubs, and their access rights. Device models with a list of parameters and a firmware update system are also stored in the cloud.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The bridge is a WS server that provides communication between the hub and remote user over the internet. It enables sending commands and receiving information from the hub without being within the home's local network.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The system can have multiple bridges located in different places. Clients select the nearest or least loaded bridge to minimize communication delays.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"One of the main features of the MajorDom is its fault tolerance. Despite the collapse of one or multiple bridges, the system perseveres and maintains its functionality. The remaining available bridges take on the tasks of the inactive bridges, ensuring uninterrupted data exchange between the hub and clients.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Even a complete loss of internet connection on the hub is not a problem. All the logic and command processing occur locally, ensuring independence from the internet connection and maintaining the ability to control devices within the local network. However, such scenarios are rare since the hub can be simultaneously connected via Wi-Fi and an Ethernet cable, and future support for cellular network will be added.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Smart home control is achieved through a mobile application that provides a user-friendly interface. However, in practice, the role of the mobile application often reduces to system configuration, while day-to-day device management is carried out using automatic scenarios and the voice assistant.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Like the hub, the voice assistant can work completely offline, ensuring security, privacy, and reliability of use.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Most importantly, now anyone, even those without programming experience, can install the MajorDom system. In the next article, I will share a detailed guide on how to do it.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}},"__N_SSG":true}